app/controllers/api_controller.rb

def license
  data={}

    if !params[:xid] then
    @lsid = params[:id]

    licenses = Licenses.first(:conditions => ["ls_id = ?", params[:id]])
---
SELECT * FROM "licenses" WHERE (ls_id = NULL) LIMIT 1