app/controllers/mashup_controller.rb

  def createlicense
    if session[:auth] != true
      redirect_to :controller=>'users', :action=> 'index'
    end
    @state = "#{Time.new} #{params[:source1]}"
    @key =  Digest::SHA1.hexdigest @state
    session[:licensekey] = @key
    session[:location] = params[:source1]
    @user = Licenses.new(:ls_id => @key, :user_id => session[:username], :domain => session[:location], :is_source => "Yes", :description => params[:desc], :source1 =>session[:location] )
    if @user.save
---
INSERT INTO "licenses" ("created_at", "updated_at", "domain", "source1", "is_source", "source2", "user_id", "source3", "source4", "description", "source5", "source6", "ls_id") VALUES('2010-05-19 21:40:59', '2010-05-19 21:40:59', 'http://google.com', 'http://google.com', 'Yes', NULL, 'aswin', NULL, NULL, 'Adding a license to Google.com - Just for test ', NULL, NULL, '459e84b78376047a7c4c9e2d98f6f92bddbd4cbf')

  def createmashup

    if session[:auth] != true
      redirect_to :controller=>'users', :action=> 'index'
    end
    @state = "#{Time.new} #{params[:source]}"
    @key =  Digest::SHA1.hexdigest @state
    session[:licensekey] = @key
    session[:location] = params[:source]
    post = DataFile.save(session[:licensekey])
---
INSERT INTO "licenses" ("created_at", "updated_at", "domain", "source1", "is_source", "source2", "user_id", "source3", "source4", "description", "source5", "source6", "ls_id") VALUES('2010-06-01 06:09:52', '2010-06-01 06:09:52', 'http://google.com', '5b5ebf55f49306736cea249e39647435133e7d14', 'No', '87eb39edd52d0fed3f8e9410a4e5d04b236420a7', 'aswin', '', '', 'Mashup', '', NULL, '326d3207b3373900327f3d0cb53a2296f5029e95')