app/controllers/mashup_controller.rb

INSERT INTO "mashups" ("user", "updated_at", "url", "key", "created_at") VALUES('asd', '2010-04-08 02:38:07', 'zxc', '8711d0e8ec65982c6f389168e3e4db5c8314086a', '2010-04-08 02:38:07')
---
  def start
        if session[:auth] != true
          redirect_to :controller=>'users', :action=> 'index'
    end

   @state = "#{Time.new} #{params[:url]}"
   @key =  Digest::SHA1.hexdigest @state
   @msg = "Your Key = #{@key}"
       post = DataFile.save(@key)
   @user = Mashup.new(:key => @key, :url => params[:url], :user => session[:username])
            if @user.save