app/controllers/users_controller.rb

  def create
       if  params[:users][:password] ==  params[:users][:password2]
         @hashedpass = Digest::SHA1.hexdigest params[:users][:password]
      @user = Users.new(:name => params[:users][:name], :email => params[:users][:email], :password => @hashedpass)
            if @user.save
---
INSERT INTO "users" ("name", "usergroup", "created_at", "updated_at", "password", "email") VALUES('aswin', 'Registered', '2010-05-04 05:56:44', '2010-05-04 05:56:44', '7c4a8d09ca3762af61e59520943dc26494f8941b', 'aswintyv@unm.edu')

def validate
   @hashedpass = Digest::SHA1.hexdigest params[:password]
  userdata1 = Users.first(:conditions => ["name = ?", params[:name]])
---
SELECT * FROM "users" WHERE (name = 'asd') LIMIT 1